app/views/questions/show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 2]]
---
<div>
  <% @question.answers.each do |answer| %>