app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "answers" ("question_id", "user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["question_id", 6], ["user_id", 1], ["body", "zdfgzdfh"], ["created_at", "2017-09-19 00:48:04.145126"], ["updated_at", "2017-09-19 00:48:04.145126"]]
---
  def create
    @question = Question.find(params[:question_id])
    @answer = @question.answers.new(answer_params)
    @answer.user = current_user

    if @answer.save