app/controllers/questions_controller.rb

INSERT INTO "questions" ("user_id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["title", "what?"], ["body", "what?!!!"], ["created_at", "2017-09-19 00:13:24.890460"], ["updated_at", "2017-09-19 00:13:24.890460"]]
---
  def create
    @question = Question.new(question_params)
    @question.user = current_user

    if @question.save